#+STARTUP: content
#+PRIORITIES: A E C 
#+TODO: TODO(t) DOIN(D) MYBE(M) WAIT(w) | DONE(d) CANC(c)
#+TODO: oliv(o) mary(m) regi(r) lind(i) lori(c) adam(a) nina(n) | done(q)
* Weekly's
** Oct 23rd
*** O Weekly Agenda
**** See Globalyzer Lite

** Nov 2nd
*** Company Meeting
**** DONE [#A] Send Lori link to Lite videos (Mainly VS)
CLOSED: [2015-11-02 Mon 16:31] DEADLINE: <2015-11-02 Mon>
***** Mention that developers must manually insert "// $NON-NLS-L$
*** Product team meeting
**** TODO [#A] Olivier's list of things that need to happen prior to release
O's notes for Tue Nov 3:
11/10/2015
- [-] 4.8.5 Lite Release [8/15]
  - [X] Attributes of the jar for the Eclipse Clickable Console Plugin & license directory with EULA + 3rd party stuff
  - [X] Finalize JUnits
  - [X] Remove the "Eclipse-Enhanced"  option: gnu
  - [X] 0) Regina to test with Java 7 on 4.5  
  - [X] 1) Regina updates the docs for the Clickable Console
  - [X] 1) Michael checks for the documentation coherence
  - [-] (NEW) Michael reviews Regina's edits to IDE-usage page.
    - Other pages reviewed. Should probably look at the IDE-usage page too.
  - [X] 2) Regina updates the docs with the supported versions
  - [X] 3) Michael & Regina to go over error messages
  - [ ] 4) Regina send Green Light Email
  - [ ] 5) O pushes the files on the installers & Let Adam know so he can PR
  - [ ] RELEASE HAPPENS HERE!
  - [ ] POST RELEASE!      
  - [ ] 4) Michael merges back both the help & code to trunk: & Send mail so M. can double check.
  - [ ] 5) Regina points the tests back to trunk (not 4.8.5)
* Globalyzer Lite
** TODO [#A] [6/10] Get Lite release ready                          :status meeting:
*** DONE [#A] [0/0] Look into lite eclipse click-ability     :status meeting:
CLOSED: [2015-10-27 Tue 18:43] :LOGBOOK: CLOCK: [2015-10-27 Tue 17:32]--[2015-10-27 Tue 17:32] =>  0:00
*** DONE [#C] [1/1] Improve error messages (up to another day of time commitment is acceptable)
CLOSED: [2015-11-04 Wed 12:52]
**** DONE [#C] Go over error messages with Regina
CLOSED: [2015-11-04 Wed 12:52]
*** DONE [#A] [5/5] ErrorLinkyThing/ClickableConsole 
CLOSED: [2015-11-04 Wed 15:46]
**** DONE [#A] [1/1] Package up Lite with ErrorLinkyThing for Regina's testing.
CLOSED: [2015-10-30 Fri 15:16]
***** DONE [#B] When ready, deal with licensing setup for ErrorLinkyThing.
CLOSED: [2015-10-29 Thu 13:05]
**** DONE [#A] Commit updated plugin changes to Lingoport owned github..
CLOSED: [2015-10-30 Fri 15:42] DEADLINE: <2015-10-30 Fri>
***** DONE [#A] Share github repo with lp_? linda, lori, olivier
CLOSED: [2015-11-02 Mon 
0:46]
**** DONE [#A] Remove debug messages
CLOSED: [2015-11-02 Mon 17:06]
**** DONE [#A] [2/2] Test that ClickableConsole works for Relevant version of:
CLOSED: [2015-11-04 Wed 15:46]
***** DONE Eclipse 
CLOSED: [2015-11-04 Wed 15:46]
***** DONE Java (7 and 8)
CLOSED: [2015-11-04 Wed 15:46]
**** DONE [#A] Check in about what plugin details we want to change for ErrorLinkyThing, then change them
CLOSED: [2015-11-03 Tue 16:13] DEADLINE: <2015-11-03 Tue>
*** TODO [#D] [6/7] Any licensing stuff for Lite
**** DONE [#B] Licenses retrieved for all but a few
**** DONE [#B] Check up on a last few difficult licenses
CLOSED: [2015-10-29 Thu 12:57]
:LOGBOOK:
CLOCK: [2015-10-29 Thu 12:53]--[2015-10-29 Thu 12:57] =>  0:04
CLOCK: [2015-10-29 Thu 12:07]--[2015-10-29 Thu 12:18] =>  0:11
:END:
**** DONE [#B] Put the licenses somewhere.
**** DONE [#B] Insure all links to licenses work.
CLOSED: [2015-10-29 Thu 12:52]
:LOGBOOK:
CLOCK: [2015-10-29 Thu 12:42]--[2015-10-29 Thu 12:52] =>  0:10
CLOCK: [2015-10-29 Thu 12:37]--[2015-10-29 Thu 12:40] =>  0:03
:END:
**** DONE [#B] Putting the Lingoport license in with Lite
CLOSED: [2015-11-02 Mon 17:19]
***** DONE [#B] Need some license changes confirmed
CLOSED: [2015-11-02 Mon 17:07]
***** CANC [#B] Link to the open source licenses from the license file.
CLOSED: [2015-11-02 Mon 17:07]
****** No link necessary. I did mention their relative location though.
***** DONE [#C] Confirm naming / directory conventions.
CLOSED: [2015-11-03 Tue 10:19]
****** DONE [#C] Put everything in a "license" directory
CLOSED: [2015-11-03 Tue 16:42]
**** CANC [#A] Put Lite's License up on our website (somewhere?)
CLOSED: [2015-11-06 Fri 14:07] DEADLINE: <2015-11-06 Fri>
**** TODO [#D] Put licenses on wiki.
*** CANC [#C] [2/2] Junit                                    :status meeting:
CLOSED: [2015-11-04 Wed 10:52]
**** DONE [#A] Some tests fail.
CLOSED: [2015-11-03 Tue 16:13] DEADLINE: <2015-11-03 Tue>
This is due to lagging behind current refactoring. It doesn't indicate a program
problem. However, I should still probably refactor these.
**** CANC [#C] Add more coverage.
CLOSED: [2015-11-04 Wed 10:52]
*** DONE [#C] Refactor eclipse-standard location
CLOSED: [2015-11-03 Tue 16:13] DEADLINE: <2015-11-03 Tue>
**** DONE [#A] Remove eclipse-enhanced, intellij, just use gnu (Update bug (5160?) with latest changes)
CLOSED: [2015-11-03 Tue 20:07]
*** regi [#A] [3/4] Internal Docs                            :status meeting:
**** done [#B] Regina's doc updates
CLOSED: [2015-10-30 Fri 15:02]
***** DONE [#A] Proof new version
CLOSED: [2015-10-30 Fri 18:11]
****** DONE [#B] Verify that there aren't other tweaks that Regina isn't aware of
CLOSED: [2015-10-30 Fri 18:11]
**** DONE [#A] Update --console-output "eclipse" eclipse screenshot.
CLOSED: [2015-11-02 Mon 17:47]
**** CANC [#A] Make the distinction between ScanSelectedItem and ScanParentDirectory clearer
CLOSED: [2015-10-27 Tue 11:57]
This may not have been clear to Michael Chen
**** TODO [#A] [7/8] Document use of plugin for Lite
DEADLINE: <2015-11-06 Fri>
***** DONE [#C] Change Plugin Name
CLOSED: [2015-10-29 Thu 20:44] DEADLINE: <2015-10-29 Thu>
***** DONE [#A] Get the Plugin Working Again! 
CLOSED: [2015-10-30 Fri 13:08]
see: http://www.vogella.com/tutorials/EclipsePlugIn/article.html#deployplugin_overview
https://stackoverflow.com/questions/582391/installing-eclipse-3-4-plugins-in-a-directory-other-than-eclipse-home-plugins/582430#582430
***** DONE [#A] Double check that the new README is correct.
CLOSED: [2015-11-02 Mon 17:08]
***** DONE [#B] Look through help pages that aren't "globalyzer-lite-IDE-usage.html"
CLOSED: [2015-11-03 Tue 20:07]
***** DONE [#A] Re-doc change from eclipse-enhanced to gnu
CLOSED: [2015-11-04 Wed 15:47]
***** DONE [#A] Review Regina's changes
CLOSED: [2015-11-04 Wed 19:32]
***** DONE [#A] Re-Merge my changes with Regina's
CLOSED: [2015-11-04 Wed 19:32]
***** MYBE [#A] Proof the post-merge result.
*** DONE [#B] [0/0] Add missing "intellij_IDEA" option.
CLOSED: [2015-10-30 Fri 19:41] DEADLINE: <2015-10-30 Fri>
*** WAIT [#A] [0/2] Any release Wrap up
**** WAIT [#A] Check organizations of files for unzipped jar file
**** regi [#A] Confirm no bugs
***** DONE [#A] Fix exit on scan failure bug
CLOSED: [2015-11-06 Fri 16:41] DEADLINE: <2015-11-06 Fri>
*** regi [#A] Document requirements on testlink.
** Lite post release
*** WAIT [#C] [0/1] Merge 4.8.5 into master. (Tell Regina first).
**** WAIT [#C] Send mail to everyone post-merge
** Misc
*** DONE [#C] [0/0] Read more into, ask about design by contract.
CLOSED: [2015-10-28 Wed 00:33]
Ok that this setter-ish-thing doesn't accept null?
ProjectDetails.java:227 
addScan(@Nonnull Scan scan) { 
    if (scan == null) {
        return;
    }
    m_scans.add(scan
Answer: It's probably best to throw an error on null, but this is OK.
*** DONE [#B] [3/3] Look into lite encoding handing for UTF-16BE_NO_BOM
CLOSED: [2015-11-03 Tue 20:13]
**** DONE [#A] Remind Mary
CLOSED: [2015-10-30 Fri 15:09] DEADLINE: <2015-10-30 Fri>
:LOGBOOK:
CLOCK: [2015-10-30 Fri 15:06]--[2015-10-30 Fri 15:09] =>  0:03
:END:
Mary said that it's a good feature request. But didn't imply that it was a 
release showstopper.
**** DONE [#B] Get final confirmation from O that it's ok to release with said problem.
CLOSED: [2015-11-02 Mon 10:47]
**** DONE [#B] Add to bugzilla.
CLOSED: [2015-11-03 Tue 20:13]
* Misc
** TODO [#C] Set better svn password
* Competitors
** TODO [#E] Populate list
*** Pasolo
*** LRM competitor thing
*** Things mentioned by EMC
*** That startup company that wanted to view our demos
* Sales engineer stuff
** Pre-Sale
*** Client Demos
*** Client Meetings
*** Sandbox Setup
*** Answering questions
**** DONE Russ needs time estimate confirmation
CLOSED: [2015-11-05 Thu 17:54] DEADLINE: <2015-11-05 Thu>
**** done [#A] (Olivier) Russ needs information about the Prep Kit setup
CLOSED: [2015-11-06 Fri 11:37] DEADLINE: <2015-11-06 Fri>
**** TODO [#B] Workbench only installation setup for Russ
Use it doc at https://docs.google.com/document/d/1TFtXLVwBrnN6b_MgQOdY_2-FyA2wtc6noKcYem4I0l4
*** Video
**** TODO [#A] Demo Video for whole suite.
***** TODO [#A] Give out Deadline for demo video
DEADLINE: <2015-11-13 Fri>
***** TODO [#A] Buy Microphone on Amazon
DEADLINE: <2015-11-13 Fri>
*** Does User Facing
*** Clients
**** Amex
** Post-Sale
*** Pilot setup
*** Install and config
*** Rule set config
*** LRM on-boarding
*** Follow-up
*** Lingotech Support
*** Customer Satisfaction
*** Clients
**** Esri
**** Blackboard
** Communication
*** Internal
**** TODO [#E] Confirm signature with Adam
*** Drive request channelling
*** 2pm Friday
** DONE [#A] Setup email signature
CLOSED: [2015-11-05 Thu 16:50] DEADLINE: <2015-11-05 Thu>
** TODO [#C] Look into stack installer
** Clients
*** Pre-Sale
**** Amex
**** Air Watch (Owned by VmWare)
***** Need
****** Training
****** Code 18n (Globalyzer)
****** ?
***** Use
****** Languages:
******* Java (Android), Csharp, IOS (Objective C?, Swift?)
****** WorldServer for Translation
**** VmWare
***** TODO [#E] Show kent grave sandbox pseudoloc.
Ww-java -> commits -> lingoport pseudoloc automation.
    showing a commit (show this if he's more technical)
Say that you can configure
- Length
- Brackets
- Characters on different unicode bit-plains.
or
(if he's less technical)
Dashboard -> Project (not javademo) 
          -> issues 
          -> find issue
          -> components 
          -> ctrl-f locales 
          -> any one of them will have issues in eo, pseudolocalized
*** Post-Sale
**** Esri
**** EMC
***** TODO [#B] Attend Meetings
**** Blackboad
****** Net 
***** DONE Russ/Blackbaud
CLOSED: [2015-11-04 Wed 17:22]
****** DONE Email Russ requesting
CLOSED: [2015-11-04 Wed 15:29]
******* TFS repo access
******* GUI vpn connection
******* Any other reqs
******* Nomachine / esri setup
****** DONE Read about CLDR
CLOSED: [2015-11-04 Wed 17:22]
****** WAIT [#B] Setup Workbench installation for Blackbaud -- Most Important
******* WAIT [#B] Follow Instructions From Doc that Andrew sent
******* WAIT [#B] Will need admin access to globalyzer.com (get password from Olivier)
